In [162]:
import pandas as pd
from pathlib import Path
from datetime import datetime

In [163]:
raw_data_dir = Path.cwd() / "data" / "raw"
clean_data_dir = Path.cwd() / "data" / "clean"

#Â Taylor Rule

### Interest Rates

(OECD)

In [187]:
df = pd.read_csv(
    raw_data_dir / "ST_interestrate_1980-2002.csv",
    sep=";",  
)

In [189]:
df = df.rename(columns={"Year": "year", "Interest Rate": "interest_rate"})

In [190]:
df.head()

   year interest_rate
0  1980         16,79
1  1981         19,23
2  1982         19,91
3  1983         18,31
4  1984         17,27

### Inflation

(WWW.RIVALUTA.it)

In [164]:
df = pd.read_csv(
    raw_data_dir / "datiinflazionemediaitalia.csv", 
    sep=";",  
)

In [165]:
df = df[1:-1]

In [166]:
df = df.rename(columns={"WWW.RIVALUTA.it": "inflation_rate"})

In [167]:
df.reset_index(col_level=0, names="year", inplace=True)

In [168]:
df = df.sort_values("year")

In [169]:
df.head()

    year inflation_rate
67  1956           3,4%
66  1957           1,3%
65  1958           2,8%
64  1959          -0,4%
63  1960           2,3%

In [170]:
df.to_csv(clean_data_dir / "inflation_rate.csv", sep="\t", index=False)

### Gdp

(Macrotrends)

In [171]:
df = pd.read_csv(
    raw_data_dir / "italy-gdp-gross-domestic-product.csv",
    sep=",",
    usecols=["date", "GDP ( Billions of US $)"],
)

In [172]:
df = df.rename(columns={"GDP ( Billions of US $)": "gdp"})

In [173]:
def date_to_year(date):
    date_object = datetime.strptime(date, "%Y-%m-%d")
    year = date_object.year
    return year

In [174]:
df["year"] = df["date"].apply(lambda x: date_to_year(x))
df.drop("date", axis=1, inplace=True)

In [175]:
df = df[["year", "gdp"]]

In [176]:
df.head()

   year        gdp
0  1960  40.385288
1  1961  44.842760
2  1962  50.383892
3  1963  57.710743
4  1964  63.175417

In [177]:
df.to_csv(clean_data_dir / "gdp.csv", sep="\t", index=False)

### Output Gap

(Nasdaq)

In [178]:
df = pd.read_csv(
    raw_data_dir / "nasdaq_output_gap.csv",
    sep=",",
)

In [179]:
df = df.rename(columns={"Value": "output_gap"})

In [180]:
df["year"] = df["Date"].apply(lambda x: date_to_year(x))
df.drop("Date", axis=1, inplace=True)

In [181]:
df = df[["year", "output_gap"]]

In [182]:
df = df.sort_values("year")

In [183]:
df.head()

    year  output_gap
44  1980      12.396
43  1981      -0.922
42  1982      -2.350
41  1983      -3.552
40  1984      -2.860

# Additional Regressors

### Unemployment

### Exchange Rate

### Foreign Interest Rate